In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-06 -1.441178  0.913961  0.579518  0.764829

In [10]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3]*4, dtype='int32'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
})

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head

<bound method DataFrame.head of                    A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-06 -1.441178  0.913961  0.579518  0.764829>

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-06 -1.441178  0.913961  0.579518  0.764829

In [15]:
df

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-06 -1.441178  0.913961  0.579518  0.764829

In [16]:
df.head(2)

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [19]:
df.values

array([[ 0.90538718, -1.81663237, -0.13740849, -0.35394797],
       [-0.11639881, -0.0746584 ,  1.41907353, -1.1346326 ],
       [-0.22700308,  0.9523845 , -0.98192888, -1.13744864],
       [-0.42385147,  0.90250416, -0.18471267, -0.05085998],
       [-0.36171572, -0.35617593, -1.69641003,  0.60307524],
       [-1.44117773,  0.91396105,  0.57951823,  0.7648293 ]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.277460  0.086897 -0.166978 -0.218164
std    0.749718  1.090335  1.102480  0.821235
min   -1.441178 -1.816632 -1.696410 -1.137449
25%   -0.408318 -0.285797 -0.782625 -0.939461
50%   -0.294359  0.413923 -0.161061 -0.202404
75%   -0.144050  0.911097  0.400287  0.439591
max    0.905387  0.952385  1.419074  0.764829

In [21]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.905387   -0.116399   -0.227003   -0.423851   -0.361716   -1.441178
B   -1.816632   -0.074658    0.952385    0.902504   -0.356176    0.913961
C   -0.137408    1.419074   -0.981929   -0.184713   -1.696410    0.579518
D   -0.353948   -1.134633   -1.137449   -0.050860    0.603075    0.764829

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.353948 -0.137408 -1.816632  0.905387
2013-01-02 -1.134633  1.419074 -0.074658 -0.116399
2013-01-03 -1.137449 -0.981929  0.952385 -0.227003
2013-01-04 -0.050860 -0.184713  0.902504 -0.423851
2013-01-05  0.603075 -1.696410 -0.356176 -0.361716
2013-01-06  0.764829  0.579518  0.913961 -1.441178

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-06 -1.441178  0.913961  0.579518  0.764829
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449

In [25]:
df['A']

2013-01-01    0.905387
2013-01-02   -0.116399
2013-01-03   -0.227003
2013-01-04   -0.423851
2013-01-05   -0.361716
2013-01-06   -1.441178
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449

In [27]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860

In [28]:
df.loc[dates[0]]

A    0.905387
B   -1.816632
C   -0.137408
D   -0.353948
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:,['A', 'B']]

                   A         B
2013-01-01  0.905387 -1.816632
2013-01-02 -0.116399 -0.074658
2013-01-03 -0.227003  0.952385
2013-01-04 -0.423851  0.902504
2013-01-05 -0.361716 -0.356176
2013-01-06 -1.441178  0.913961

In [30]:
df.loc['20130102', ['A', 'B']]

A   -0.116399
B   -0.074658
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.loc[dates[0], 'A']

0.90538717581964967

In [32]:
df.at[dates[0], 'A']

0.90538717581964967

In [33]:
df.iloc[3]

A   -0.423851
B    0.902504
C   -0.184713
D   -0.050860
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-06 -1.441178  0.913961  0.579518  0.764829

In [35]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.423851  0.902504
2013-01-05 -0.361716 -0.356176

In [36]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.116399  1.419074
2013-01-03 -0.227003 -0.981929
2013-01-05 -0.361716 -1.696410

In [37]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449

In [38]:
df.iloc[1,1]

-0.074658399402995942

In [39]:
df.iat[1,1]  # at/iat 比 loc/iloc要快

-0.074658399402995942

In [40]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948

In [42]:
df[df>0]

                   A         B         C         D
2013-01-01  0.905387       NaN       NaN       NaN
2013-01-02       NaN       NaN  1.419074       NaN
2013-01-03       NaN  0.952385       NaN       NaN
2013-01-04       NaN  0.902504       NaN       NaN
2013-01-05       NaN       NaN       NaN  0.603075
2013-01-06       NaN  0.913961  0.579518  0.764829

In [43]:
df2 = df.copy()

In [44]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [45]:
df2

                   A         B         C         D      E
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948    one
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633    one
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449    two
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860  three
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075   four
2013-01-06 -1.441178  0.913961  0.579518  0.764829  three

In [47]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449   two
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075  four

In [48]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [49]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [50]:
df2['F'] = s1

In [51]:
df2

                   A         B         C         D      E    F
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948    one  NaN
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633    one  1.0
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449    two  2.0
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860  three  3.0
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075   four  4.0
2013-01-06 -1.441178  0.913961  0.579518  0.764829  three  5.0

In [53]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [54]:
df1

                   A         B         C         D   E
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948 NaN
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633 NaN
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449 NaN
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860 NaN

In [57]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948  1.0
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633  1.0
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449  NaN
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860  NaN

In [56]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948  1.0
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633  1.0

In [59]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948  1.0
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633  1.0
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449  5.0
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860  5.0

In [60]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [61]:
df

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02 -0.116399 -0.074658  1.419074 -1.134633
2013-01-03 -0.227003  0.952385 -0.981929 -1.137449
2013-01-04 -0.423851  0.902504 -0.184713 -0.050860
2013-01-05 -0.361716 -0.356176 -1.696410  0.603075
2013-01-06 -1.441178  0.913961  0.579518  0.764829

In [62]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.905387 -1.816632 -0.137408 -0.353948
2013-01-02  0.788988 -1.891291  1.281665 -1.488581
2013-01-03  0.561985 -0.938906  0.299736 -2.626029
2013-01-04  0.138134 -0.036402  0.115023 -2.676889
2013-01-05 -0.223582 -0.392578 -1.581387 -2.073814
2013-01-06 -1.664760  0.521383 -1.001868 -1.308985

In [63]:
df.apply(lambda x: x.max()-x.min())

A    2.346565
B    2.769017
C    3.115484
D    1.902278
dtype: float64